benchmark/pimpleFoam/cells_916801/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.54 0 0);

boundaryField
{
    inlet
    {
        type            turbulentInlet;
        referenceField  uniform (0.54 0 0);
        fluctuationScale (0.0 0.02 0.0);
        value           uniform (0.54 0 0);
    }

    inlet2
    {
        type            fixedValue;
        value           uniform (0.54 0 0);
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    walls  
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    sides
    {
        type            slip;
    }

    lowerUpper
    {
        type            slip;
    }
}

// ************************************************************************* //
